#!/bin/bash

#[sqlite❣29231fdc7920 (月 10月 28 12:45:23) ~/script_scratch/python]$python
#Python 3.7.4 (default, Oct 23 2019, 21:56:45) 
#[GCC 4.8.5 20150623 (Red Hat 4.8.5-39)] on linux
#Type "help", "copyright", "credits" or "license" for more information.
#>>> from functools import reduce
#>>> reduce(lambda x,y: x+x, [1, 2, 3])
#4
#>>> reduce(lambda x,y: x+x, [1, 2, 3,4])
#8
#>>> reduce(lambda x,y: x+x, [1, 2, 3,4,5])
#16
#>>> reduce(lambda x,y: x+x, [1,2,3,4,5])
#16
#>>> reduce(lambda x,y: x+x, [1])
#1
#>>> reduce(lambda x,y: x+x, [1,2])
#2
#>>> reduce(lambda x,y: x+x, [1,2,3])
#4
#>>> reduce(lambda x,y: x+x, [1,2,3,4])
#8
#>>> reduce(lambda x,y: x+x, [1,2,3,4,5])
#16
#>>> reduce(lambda x,y: x+y, [1, 2, 3], 10)
#16
#>>> reduce(lambda x,y: x+y, [1, 2, 3], 10)
#16
#>>> reduce(lambda x,y: x+y, [1, 2, 3], -4)
#2
#>>> reduce(lambda x,y: x+x, [1, 2, 3], 0)
#0
#>>> reduce(lambda x,y: x+x, [1, 2, 3])
#4

#>>> reduce(lambda x,y: x+y, [1, 2, 3], 0)
#6
#初項:0
#次項:1+(0)=1+0=1
#次項:2+(1+(0))=2+1+0=3
#次項:3+(2+(1+(0)))=3+2+(1+(0))=3+2+(1+0)=3+2+1=6

#a1=0
#a2=a1+1=0+1=1
#a3=a2+2=(a1+1)+2=(0+1)+2=3
#a4=a3+3=(a2+2)+3=((0+1)+2)+3=6

#>>> reduce(lambda y,x: x+y, [1,2,3])
#6
#初項:0(していなかったらでふぉゼロ)
#次項:1+(0)=1+0=1
#次項:2+(1+(0))=2+1+0=3
#次項:3+(2+(1+(0)))=3+2+(1+(0))=3+2+(1+0)=3+2+1=6

#>>> reduce(lambda x,y: x+x, [1,2,3])
#4



#初項:0(していなかったらでふぉゼロ)
#次項:1+(0)=1+0=1
#次項:2+(1+(0))=2+1+0=3
#次項:3+(2+(1+(0)))=3+2+(1+(0))=3+2+(1+0)=3+2+1=6

#>>> reduce(lambda y,x: y+y, [1,2,3])
#4




#>>> reduce(lambda y,x: x+x, [1,2,3,4,5])
#10

#左から一つ目の要素、その要素以外すべてでグルーピング。一つ目の要素をフェッチするものがなくなったら、おしまい
#egisonと同じで自身とそれら以外。


#>>> reduce(lambda x,y: x+x, [1,2,3,4,5])
#16
#>>> reduce(lambda y,x: x+x, [1,2,3,4,5])
#10

初項:0
次項:1+(1+2+3+4+5)
次項:2+(2+3+4+5)
次項:3+(3+4+5)
次項:4+(4+5)
次項:5+(5)

初項:0
次項:1+(1+2+3+4+5)
次項:2+(2+3+4+5)
次項:3+(3+4+5)
次項:4+(4+5)
次項:5+(5)

初項:0
次項:5+(5)
次項:4+(4+5)
次項:3+(3+4+5)
次項:2+(2+3+4+5)
次項:1+(1+2+3+4+5)




